app/views/owners/show.html.erb


  <% @owner.cats.each do |cat| %>
---
SELECT "cats".* FROM "cats" WHERE "cats"."owner_id" = ?  [["owner_id", 8]]