app/controllers/cats_controller.rb

  def show
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def set_cat
      @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 15]]