app/controllers/matches_controller.rb

INSERT INTO "matches" ("match_type", "actor_id", "receiver_id") VALUES (?, ?, ?)  [["match_type", "t"], ["actor_id", 14], ["receiver_id", 6]]
---
  def create
    binding.pry
    if params[:commit] == 'Yes'
      @match = Match.new
      @match.match_type = true
      @match.actor_id = session[:cat_id]
      @match.receiver_id  = params[:receiver_id]
      @match.save