app/controllers/owners_controller.rb

  def index
    @owners = Owner.all
---
SELECT "owners".* FROM "owners"

  def set_owner
    @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", 8]]