app/controllers/sessions_controller.rb

INSERT INTO "cats" ("provider", "uid", "name", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["provider", "twitter"], ["uid", "1138930939"], ["name", "Seth M Phillips"], ["owner_id", 1], ["created_at", "2015-07-17 02:26:53.030548"], ["updated_at", "2015-07-17 02:26:53.030548"]]
---
  def create
    @cat = Cat.find_or_create_from_auth_hash(auth_hash)