app/controllers/static_pages_controller.rb

  def home
    @action = Action.new
    @cat = Cat.all.sample(1).first
---
SELECT "cats".* FROM "cats"